app/controllers/products_controller.rb

  def create

    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`created_at`, `price`, `slug`, `title`, `updated_at`) VALUES ('2013-01-11 13:11:52', 11, 'aa', 'aa', '2013-01-11 13:11:52')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
UPDATE `products` SET `price` = 12, `updated_at` = '2013-01-11 12:22:11' WHERE `products`.`id` = 1

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
DELETE FROM `products` WHERE `products`.`id` = 7

  def address_info
    @address = Address.new(:product_id => params[:id])
    @product = Product.find_by_id(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

  def address_create


    @address = Address.new(params[:address])

    respond_to do |format|
      if @address.save_with_payment
---
INSERT INTO `addresses` (`created_at`, `email`, `product_id`, `stripe_card_token`, `stripe_customer_token`, `updated_at`) VALUES ('2013-01-17 10:06:45', 'test', 1, 'tok_17UXRNVqkBQKar', 'cus_17UYRXEqL0JLWl', '2013-01-17 10:06:45')