app/views/products/show.html.erb

SELECT `assets`.* FROM `assets` WHERE `assets`.`product_id` = 1 LIMIT 1
---
  <%#= image_tag @product.assets.image.url %>
  <%= image_tag @product.assets.first.image.url %>